{
    "ru": {
        "button-light": "Тема",
        "languageButton": "Язык",
        "home": "Главная",
        "about": "О нас",
        "blog": "Блог",
        "contact": "Контакты",
        "courses": "Курсы",
        "ser": "Поиск",
        "cart": "Корзина",
        "signup": "Регистрация",
        "no-c": "No-Code development: как стать ноукодером и войти в IT без программирования",
        "how": "Как устроена сфера «no-code development» и какие навыки нужны на старте — разберемся вместе с основателем школы Code Breakers Елизаветой Хузаидзе.",
        "ther": "Идет война, многие ИТ-специалисты вынуждены переезжать, менять специализацию, изучать новые языки программирования и менять стек, а некоторые даже на время уходят из профессии. Заходить в IT с нуля сейчас, когда не очень понятно, где и что изучать, может показаться безумием. Но вариант все же существует — это нокод.",
        "no-co": "No-code-технологиям уже более двадцати лет, но настоящий спрос на быстроразрабатываемые и недорогие сайты появился в эпоху пандемии. Когда компании массово перешли на цифровые технологии, оказалось, что многие бизнес-задачи можно решить без программирования. Сейчас на рынке программного обеспечения существуют десятки инструментов no-code и low-code, а специалистов по no-code, по слухам, нанимают даже в GAFAM.",
        "ed": "Ликбез: что такое no-code и low-code",
        "ev": "Даже если вы (вдруг) впервые слышите словосочетание no-code, вы, скорее всего, знаете о «Тильде» или «Редимаге» — самых популярных редакторах без кода. Это пользовательские приложения, работающие по принципу конструктора. Любой человек — бизнесмен или дизайнер без малейшего знания кода — может собрать сайт из готовых блоков, прикрепить к нему платежную систему или организовать сбор заявок.",
        "thi": "Вот как выглядит интерфейс:",
        "the": "Существует множество подобных редакторов без кода: Webflow, Glide, Bubble и другие. Все они позволяют создать фронтенд без кода и отличаются особенностями интерфейса и функционалом. Помимо них созданы вспомогательные no-code инструменты, необходимые для построения внутренней логики сайта.",
        "is": "Еще есть понятие low-code — это случаи, когда не хватает инструментов no-code, и создаются «гибридные» сайты. В Tilda или Webflow, например, при необходимости можно написать чекбокс или кнопку в одной строчке кода. Или вы можете создать интерфейс в редакторе без кода, а серверную часть полностью написать в коде. Также существует отдельная группа low-code редакторов. По сути, они предназначены для программистов, которые хотят облегчить свою работу, собирая отдельные части веб-сайта без кода.",
        "bas": "Базовые инструменты без кода<br>Давайте посмотрим, с чем сейчас в основном работают нокодеры. Начнем с инструментов для создания фронтенда.",
        "rea": "Готовый журнал",
        "prothe": "Программа позволяет собирать интерфейсы с помощью шаблонов или самостоятельно. Веб-сайты могут быть анимированными, а адаптивные версии могут создаваться автоматически или вручную. Примеры можно посмотреть в галерее Readymag. Readymag в настоящее время предлагает бесплатную годовую подписку для жителей Украины.",
        "til": "Тильда",
        "apro": "Продукт, примерно аналогичный по функциональности Readymag. Ключевое различие между ними — особенности интерфейса. На Тильде также есть больше шаблонов. Считается, что он больше подойдет бизнесменам, не имеющим представления о дизайне. На официальном сайте представлены примеры сайтов, сделанных в редакторе.",
        "webf": "веб-поток",
        "thia": "Этот инструмент считается немного более продвинутым с точки зрения дизайна: Webflow позволяет попиксельно компоновать практически любой веб-сайт так, как задумано. Вы можете делать анимации и создавать более умные мобильные версии, чем в Тильде и Readymag. Но есть и обратная сторона: если вы хотите сделать сайт быстро и без погружения, интерфейс будет сложным. Примеры готовых сайтов можно найти в разделе Сообщество Webflow.",
        "toc": "Чтобы создать сайт-портфолио или рекламный лендинг со ссылкой на основной сайт, вам достаточно собрать интерфейс в одном из этих редакторов. Но если вам нужно построить внутреннюю логику сайта, помогут другие инструменты. Например, есть бескодовая база данных Airtable, сервис для реализации системы бронирования Setmore, почтовые сервисы Mailchimp и Unisender, программы для настройки интеграций — Make (ранее Integromat) и Zapier.",
        "doe": "Должен ли нокодер уметь программировать?",
        "whe": "Когда непрограммист хоть немного знает программирование, он может добавить некоторые недостающие функции или визуальные эффекты, работая с инструментами без кода. Используя код, вы можете делать разные полезные вещи. Например, эффект размытия фона или флажки с множественным выбором — многие элементы дизайна невозможно собрать в редакторах.",
        "youc": "Вы можете объединить фронтенд на nocode с полностью кастомным бэкендом, если сайту нужен сложный функционал — скажем, трансляция каких-то обновленных данных из таблиц.",
        "thear": "Также существуют платформы, предназначенные для совмещения программирования и работы в визуальном редакторе. Например, Дирекчуал, Бетти Блокс, Мендикс. Они отличаются от рассмотренных нами платформ без кода более продвинутыми возможностями и простотой использования для программистов.",
        "whedo": "Где работают нокодеры?",
        "oneof": "Одним из преимуществ nocode является возможность собрать полноценный сайт самостоятельно, без привлечения большой команды. Многие люди приходят в эту сферу с целью стать фрилансером, в основном для малого бизнеса. Но известные бренды также используют Nocode для специальных проектов, целевых страниц и внутренних продуктов.",
        "inadd": "Помимо фриланса и работы в штате компании, вы также можете устроиться на работу в дизайн-студию или студию разработки — некоторые, кроме всего прочего, занимаются разработкой сайтов без кода. А есть студии, которые полностью специализируются на решениях без кода: например, Zero to One и Method Zero. Многие международные компании ищут специалистов no-code: вакансии доступны на Upwork, LinkedIn, Indeed и других международных платформах.",
        "theare": "Вариантов работы много, и каждый имеет свою специфику. Фриланс – это свобода выбора клиентов, удобный график и возможность создать продукт от начала до конца. Коллектив крупной компании – это стабильность и возможность работать в конкретной сфере, которая вас интересует. Студия разработки — это возможность работать в команде для решения самых разных задач клиентов.",
"ji": "Подпишитесь на нашу рассылку, чтобы быть в курсе новых функций и обновлений.",
"cri": "Подписаться",
"ges": "Страницы",
"ome": "Главная",
"out": "О нас",
"ont": "Контакт",
"log": "Блог",
"ours": "Курсы",
"che": "Учителя",
"cms": "Страницы CMS",
"blopo": "Запись в блоге",
"blocat": "Категории блога",
"cousin": "Одиночный курс",
"coucat": "Категории курсов",
"propa": "Страница продукта",
"procat": "Категории продуктов",
"teasin": "Один учитель",
"episin": "Одиночная серия",
"accpa": "Страницы аккаунта",
"gin": "Войти",
"ups": "Зарегистрироваться",
"forpas": "Забыли пароль",
"reste": "Сбросить пароль",
"mail": "Подтверждение по электронной почте",
"utili": "Вспомогательные страницы",
"tul": "Руководство по стилю",
"cha": "Изменения",
"loc": "Лицензии",
"passw": "Пароль",
"min": "Минимальный квадрат",
"oiw": ". Работает на",
"aut": "Авторизация",
"wd": "Webflow"
    },
    "en": {
        "button-light": "Thema",
        "languageButton": "Language",
        "home": "Home",
        "about": "About",
        "blog": "Blog",
        "contact": "Contact",
        "courses": "Courses",
        "ser": "Search",
        "cart": "Cart",
        "no-c": "No-Code development: how to become a no-coder and enter IT without programming",
        "how": "How the field of “no-code development” works and what skills are needed at the start - we’ll figure it out together with the founder of the Code Breakers school, Elizaveta Khuzaidze.",
        "ther": "There is a war going on, many IT specialists are forced to move, change their specialization, learn new programming languages ​​and change their stack, and some even leave the profession for a while. Entering IT from scratch now, when it is not very clear where and what to study, may seem crazy. But an option still exists - this is a nocode.",
        "no-co": "No-code technologies are more than twenty years old, but the real demand for fast-to-develop and inexpensive websites appeared in the era of the pandemic. When companies went digital en masse, it turned out that many business problems could be solved without programming. Now there are dozens of no-code and low-code tools on the software market, and no-code specialists, according to rumors, are being hired even at GAFAM.",
        "ed": "Educational program: what is no-code and low-code",
        "ev": "Even if you (suddenly) hear the phrase no-code for the first time, you most likely know about “Tilda” or “Redimag” - the most popular no-code editors. These are user applications that work on the principle of a designer. Any person - a businessman or a designer without the slightest knowledge of code - can assemble a website from ready-made blocks, attach a payment system to it, or organize the collection of applications.",
        "thi": "This is what the interface looks like:",
        "the": "There are many similar no-code editors: Webflow, Glide, Bubble and others. All of them allow you to create a frontend without code and differ in interface features and functionality. In addition to them, auxiliary no-code tools have been created that are needed to build the internal logic of the site.",
        "is": "There is also the concept of low-code - these are cases when there are not enough no-code tools, and “hybrid” sites are created. In Tilda or Webflow, for example, you can write a checkbox or button in one line of code, if necessary. Or you can make the frontend in a no-code editor, and write the backend completely in code. There is also a separate group of low-code editors. Basically, they are tailored for programmers who want to make their work easier by assembling individual pieces of a website without code.",
        "bas": "Basic no-code tools<br>Let's take a look at what nocoders mostly work with now. Let's start with tools for creating a frontend.",
        "rea": "Readymag",
        "prothe": "The program allows you to assemble interfaces using templates or independently. Websites can be animated and adaptive versions can be created automatically or manually. Examples can be viewed in the Readymag gallery. Readymag currently offers a free annual subscription for residents of Ukraine.",
        "til": "Tilda",
        "apro": "A product roughly similar in functionality to Readymag. The key difference between them is the interface features. Tilda also has more templates. It is believed that it is more suitable for businessmen who have no idea about design. The official website contains examples of sites made in the editor.",
        "webf": "Webflow",
        "thia": "This tool is considered a little more advanced in terms of design: Webflow makes it possible to layout almost any website pixel-by-pixel as intended. You can make animations and create smarter mobile versions than in Tilda and Readymag. But there is also a downside: if you want to make a website quickly and without immersion, the interface will be complicated. Examples of ready-made websites can be found in the Webflow Community section.",
        "toc": "To create a portfolio website or advertising landing page with a link to the main website, you just need to assemble the interface in one of these editors. But if you need to build the internal logic of the site, other tools help. For example, there is a no-code database Airtable, a service for implementing the reservation system Setmore, mailing services Mailchimp and Unisender, programs for setting up integrations - Make (formerly Integromat) and Zapier.",
        "doe": "Does a nocoder need to be able to program?",
        "whe": "When a no-coder knows at least a little programming, he can add some missing functions or visual effects by working in no-code tools. Using code you can do various useful things. For example, a background blur effect or multiple choice checkboxes - many design elements cannot be assembled in editors.",
        "youc": "You can combine a frontend in nocode with a completely custom backend if the site needs complex functionality - say, broadcasting some updated data from tables.",
        "thear": "There are also platforms designed for a combination of programming and working in a visual editor. For example, Directual, Betty Blocks, Mendix. They differ from the no-code platforms that we reviewed in their more advanced capabilities and ease of use for programmers.",
        "whedo": "Where do nocoders work?",
        "oneof": "One of the advantages of nocode is the ability to put together a full-fledged website yourself, without involving a large team. Many people enter this field with the goal of freelancing, mainly for small businesses. But well-known brands also use nocode for special projects, landing pages and internal products.",
        "inadd": "In addition to freelancing and working on the staff of a company, you can also get a job in a design studio or development studio - some, among other things, develop websites without code. And there are studios that completely specialize in no-code solutions: for example, Zero to One and Method Zero. Many international companies are looking for no-code specialists: vacancies are available on Upwork, LinkedIn, Indeed and other international platforms.",
        "theare": "There are many options for work, and each has its own specifics. Freelancing means freedom to choose clients, a convenient schedule and the opportunity to create a product from start to finish. The staff of a large company means stability and a chance to work in a specific area that interests you. A development studio is an opportunity to work in a team to solve a variety of customer problems.",
        "signup": "Sign Up",    
        "ji": "Join our newsletter to stay up to date on features and releases.",
        "cri": "Subscribe",
        "ges": "Pages",
        "ome": "Home",
        "out": "About",
        "ont": "Contact",
        "log": "Blog",
        "ours": "Courses",
        "che": "Teachers",
        "cms": "CMS Pages",
        "blopo": "Blog Post",
        "blocat": "Blog Categories",
        "cousin": "Courses Single",
        "coucat": "Courses Categories",
        "propa": "Product Page",
        "procat": "Product Categories",
        "teasin": "Teachers Single",
        "episin": "Episode Single",
        "accpa": "Account Pages",
        "gin": "Login",
        "ups": "Sign Up",
        "forpas": "Forgot Password",
        "reste": "Reset Password",
        "mail": "Email Confirmation",
        "utili": "Utility Pages",
        "tul": "Style Guide",
        "cha": "Changelog",
        "loc": "Licenses",
        "passw": "Password",
        "min": "Minimal Square",
        "oiw": ". Powered by",
        "aut": "Autorization",
        "wd": "Webflow"
    }
  }